{
  "basic_identity": {
    "comment": "This section contains essential identifiers and descriptions of the dataset.",
    "dataset_id": "System Generated - Will be generated by the system and should be unique for each dataset.",
    "title": "Mandatory - Title of the Dataset.",
    "author": {
      "name": "Mandatory - Name of the individual or organization responsible for the dataset.",
      "organization": "Optional - Name of the organization associated with the author, if applicable."
    },
    "description": "Mandatory - A detailed description of the dataset and its contents.",
    "version": "Optional - Version of the dataset, if applicable.",
    "creation_date": "Mandatory - Date when the dataset was created in the format YYYY-MM-DD.",
    "last_updated": "Optional - Date when the dataset was last updated in the format YYYY-MM-DD."
  },
  "related_publication": "Optional - Any papers related to the dataset's creation or use",
  "usage": {
    "comment": "This section details how the dataset can be used, including licensing and format.",
    "license": "Mandatory - Type of license under which the dataset is distributed.",
    "format": "Mandatory - Format of the dataset (e.g., CSV, JPEG, MP4, WAV, etc.).",
    "size": "Mandatory - Size of the dataset, typically in MB or GB."
  },
  "document": {
    "comment": "This section provides links to the dataset itself and its accompanying documentation.",
    "download_url": "Mandatory - URL where the dataset can be downloaded.",
    "documentation_url": "Optional - URL to the dataset documentation or user guide."
  },
  "format_details": {
    "comment": "This section is conditional. Only fill out the subsection that corresponds to the format of your dataset.",
    "csv": {
      "number_of_rows": "Mandatory - Total number of rows in the CSV file",
      "number_of_columns": "Mandatory - Total number of columns in the CSV file",
      "columns": [
        {
          "header": "Mandatory - Name of the column",
          "description": "Mandatory - Description of the data each column holds",
          "type": "Mandatory - Data type of the column (integer, string, date, etc.)"
        }
      ]
    },
    "image": {
      "number_of_images": "Mandatory - Total number of images in the dataset.",
      "resolution": "Optional - Resolution of the images (e.g., 1920x1080).",
      "image_format": "Optional - File format of the images (e.g., JPEG, PNG)."
    },
    "video": {
      "number_of_videos": "Mandatory - Total number of videos in the dataset.",
      "average_length": "Optional - Average length of the videos (in minutes or seconds).",
      "video_format": "Optional - File format of the videos (e.g., MP4, AVI).",
      "resolution": "Optional - Resolution of the videos (e.g., 1920x1080)."
    },
    "audio": {
      "number_of_audio_files": "Mandatory - Total number of audio files in the dataset.",
      "average_length": "Optional - Average length of the audio files (in minutes or seconds).",
      "audio_format": "Optional - File format of the audio files (e.g., MP3, WAV)."
    }
  },
  "related_datasets": {
    "comment": "This section can include references to datasets that are related or derived from the current dataset.",
    "related_dataset_ids": ["Optional - Identifier of related datasets."]
  },
  "usage_examples": {
    "comment": "This section can be used to give examples of how the dataset has been or can be used.",
    "description": "Optional - Brief description of a usage example.",
    "example_url": "Optional - URL to more detailed information or code example."
  },
  "citation": {
    "comment": "If there is a recommended way to cite the dataset, include it here.",
    "citation_text": "Optional - Recommended citation for the dataset."
  }
}
